apache/nuttx/arch/mips/src/pic32mx/pic32mx_int.h
#if defined(CHIP_PIC32MX5) || defined(CHIP_PIC32MX6) || defined(CHIP_PIC32MX7)
#  define PIC32MX_INT_IPC12          (PIC32MX_INT_K1BASE+PIC32MX_INT_IPC12_OFFSET)
#  define PIC32MX_INT_IPC12CLR       (PIC32MX_INT_K1BASE+PIC32MX_INT_IPC12CLR_OFFSET)
#  define PIC32MX_INT_IPC12SET       (PIC32MX_INT_K1BASE+PIC32MX_INT_IPC12SET_OFFSET)
#  define PIC32MX_INT_IPC12INV       (PIC32MX_INT_K1BASE+PIC32MX_INT_IPC12INV_OFFSET)
#endif

/* Register Bit-Field Definitions *******************************************/

/* Interrupt control register */

#define INT_INTCON_INT0EP            (1 << 0)  /* Bit 0:  External interrupt 0 edge polarity control */
#define INT_INTCON_INT1EP            (1 << 1)  /* Bit 1:  External interrupt 1 edge polarity control */
#define INT_INTCON_INT2EP            (1 << 2)  /* Bit 2:  External interrupt 2 edge polarity control */
#define INT_INTCON_INT3EP            (1 << 3)  /* Bit 3:  External interrupt 3 edge polarity control */
#define INT_INTCON_INT4EP            (1 << 4)  /* Bit 4:  External interrupt 4 edge polarity control */
#define INT_INTCON_TPC_SHIFT         (8)       /* Bits 8-10: Temporal proximity control */
#define INT_INTCON_TPC_MASK          (7 << INT_INTCON_TPC_SHIFT)
#  define INT_INTCON_TPC_DIS         (0 << INT_INTCON_TPC_SHIFT) /* Disables proximity timer */
#  define INT_INTCON_TPC_PRIO1       (1 << INT_INTCON_TPC_SHIFT) /* Int group priority 1 start IP timer */
#  define INT_INTCON_TPC_PRIO2       (2 << INT_INTCON_TPC_SHIFT) /* Int group priority <=2 start TP timer */
#  define INT_INTCON_TPC_PRIO3       (3 << INT_INTCON_TPC_SHIFT) /* Int group priority <=3 start TP timer */
#  define INT_INTCON_TPC_PRIO4       (4 << INT_INTCON_TPC_SHIFT) /* Int group priority <=4 start TP timer */
#  define INT_INTCON_TPC_PRIO5       (5 << INT_INTCON_TPC_SHIFT) /* Int group priority <=5 start TP timer */
#  define INT_INTCON_TPC_PRIO6       (6 << INT_INTCON_TPC_SHIFT) /* Int group priority <=6 start TP timer */
#  define INT_INTCON_TPC_PRIO7       (7 << INT_INTCON_TPC_SHIFT) /* Int group priority <=7 start TP timer */
#define INT_INTCON_MVEC              (1 << 12) /* Bit 12: Multi vector configuration */

#if defined(CHIP_PIC32MX3) || defined(CHIP_PIC32MX4) || defined(CHIP_PIC32MX5) || \
    defined(CHIP_PIC32MX6) || defined(CHIP_PIC32MX7)
#  define INT_INTCON_FRZ             (1 << 14) /* Bit 14: Freeze in debug exception mode */
#endif

#define INT_INTCON_SS0               (1 << 16) /* Bit 16: Single vector shadow register set */

/* Interrupt status register */

#define INT_INTSTAT_VEC_SHIFT        (0)       /* Bits 0-5: Interrupt vector */
#define INT_INTSTAT_VEC_MASK         (0x3f << INT_INTSTAT_VEC_SHIFT)
#define INT_INTSTAT_RIPL_SHIFT       (8)       /* Bits 8-10: Requested priority level */
#define INT_INTSTAT_RIPL_MASK        (7 << INT_INTSTAT_RIPL_SHIFT)

/* Temporal proximity timer register -- This register contains a 32-bit value
 * with no field definitions.
 */

/* Interrupt flag status register 0 and Interrupt enable control register 0 */

#if defined(CHIP_PIC32MX1) || defined(CHIP_PIC32MX2)

#define INT_CT                       (1 << 0)  /* Vector: 0, Core Timer Interrupt */
#define INT_CS0                      (1 << 1)  /* Vector: 1, Core Software Interrupt 0 */
#define INT_CS1                      (1 << 2)  /* Vector: 2, Core Software Interrupt 1 */
#define INT_INT0                     (1 << 3)  /* Vector: 3, External Interrupt 0 */
#define INT_T1                       (1 << 4)  /* Vector: 4, Timer 1 */
#define INT_IC1E                     (1 << 5)  /* Vector: 5, Input Capture 1 Error */
#define INT_IC1                      (1 << 6)  /* Vector: 5, Input Capture 1 */
#define INT_OC1                      (1 << 7)  /* Vector: 6, Output Compare 1 */
#define INT_INT1                     (1 << 8)  /* Vector: 7, External Interrupt 1 */
#define INT_T2                       (1 << 9)  /* Vector: 8, Timer 2 */
#define INT_IC2E                     (1 << 10) /* Vector: 9, Input Capture 2 Error */
#define INT_IC2                      (1 << 11) /* Vector: 9, Input Capture 2 */
#define INT_OC2                      (1 << 12) /* Vector: 10, Output Compare 2 */
#define INT_INT2                     (1 << 13) /* Vector: 11, External Interrupt 2 */
#define INT_T3                       (1 << 14) /* Vector: 12, Timer 3 */
#define INT_IC3E                     (1 << 15) /* Vector: 13, Input Capture 3 Error */
#define INT_IC3                      (1 << 16) /* Vector: 13, Input Capture 3 */
#define INT_OC3                      (1 << 17) /* Vector: 14, Output Compare 3 */
#define INT_INT3                     (1 << 18) /* Vector: 15, External Interrupt 3 */
#define INT_T4                       (1 << 19) /* Vector: 16, Timer 4 */
#define INT_IC4E                     (1 << 20) /* Vector: 17, Input Capture 4 Error */
#define INT_IC4                      (1 << 21) /* Vector: 17, Input Capture 4 */
#define INT_OC4                      (1 << 22) /* Vector: 18, Output Compare 4 */
#define INT_INT4                     (1 << 23) /* Vector: 19, External Interrupt 4 */
#define INT_T5                       (1 << 24) /* Vector: 20, Timer 5 */
#define INT_IC5E                     (1 << 25) /* Vector: 21, Input Capture 5 Error */
#define INT_IC5                      (1 << 26) /* Vector: 21, Input Capture 5 */
#define INT_OC5                      (1 << 27) /* Vector: 22, Output Compare 5 */
#define INT_AD1                      (1 << 28) /* Vector: 23, ADC1 Convert Done */
#define INT_FSCM                     (1 << 29) /* Vector: 24, Fail-Safe Clock Monitor */
#define INT_RTCC                     (1 << 30) /* Vector: 25, Real-Time Clock and Calendar */
#define INT_FCE                      (1 << 31) /* Vector: 26, Flash Control Event */

#elif defined(CHIP_PIC32MX3) || defined(CHIP_PIC32MX4)

#  define INT_CT                     (1 << 0)  /* Vector: 0, Core Timer Interrupt */
#  define INT_CS0                    (1 << 1)  /* Vector: 1, Core Software Interrupt 0 */
#  define INT_CS1                    (1 << 2)  /* Vector: 2, Core Software Interrupt 1 */
#  define INT_INT0                   (1 << 3)  /* Vector: 3, External Interrupt 0 */
#  define INT_T1                     (1 << 4)  /* Vector: 4, Timer 1 */
#  define INT_IC1                    (1 << 5)  /* Vector: 5, Input Capture 1 */
#  define INT_OC1                    (1 << 6)  /* Vector: 6, Output Compare 1 */
#  define INT_INT1                   (1 << 7)  /* Vector: 7, External Interrupt 1 */
#  define INT_T2                     (1 << 8)  /* Vector: 8, Timer 2 */
#  define INT_IC2                    (1 << 9)  /* Vector: 9, Input Capture 2 */
#  define INT_OC2                    (1 << 10) /* Vector: 10, Output Compare 2 */
#  define INT_INT2                   (1 << 11) /* Vector: 11, External Interrupt 2 */
#  define INT_T3                     (1 << 12) /* Vector: 12, Timer 3 */
#  define INT_IC3                    (1 << 13) /* Vector: 13, Input Capture 3 */
#  define INT_OC3                    (1 << 14) /* Vector: 14, Output Compare 3 */
#  define INT_INT3                   (1 << 15) /* Vector: 15, External Interrupt 3 */
#  define INT_T4                     (1 << 16) /* Vector: 16, Timer 4 */
#  define INT_IC4                    (1 << 17) /* Vector: 17, Input Capture 4 */
#  define INT_OC4                    (1 << 18) /* Vector: 18, Output Compare 4 */
#  define INT_INT4                   (1 << 19) /* Vector: 19, External Interrupt 4 */
#  define INT_T5                     (1 << 20) /* Vector: 20, Timer 5 */
#  define INT_IC5                    (1 << 21) /* Vector: 21, Input Capture 5 */
#  define INT_OC5                    (1 << 22) /* Vector: 22, Output Compare 5 */
#  define INT_SPI1E                  (1 << 23) /* Vector: 23, SPI1 Error */
#  define INT_SPI1TX                 (1 << 24) /* Vector: 23, "  " Transfer done */
#  define INT_SPI1RX                 (1 << 25) /* Vector: 23, "  " Receive done */
#  define INT_U1E                    (1 << 26) /* Vector: 24, UART1 Error */
#  define INT_U1RX                   (1 << 27) /* Vector: 24, "   " Receiver */
#  define INT_U1TX                   (1 << 28) /* Vector: 24, "   " Transmitter */
#  define INT_I2C1B                  (1 << 29) /* Vector: 25, I2C1 Bus collision event */
#  define INT_I2C1S                  (1 << 30) /* Vector: 25, "  " Slave event */
#  define INT_I2C1M                  (1 << 31) /* Vector: 25, "  " Master event */

#elif defined(CHIP_PIC32MX5) || defined(CHIP_PIC32MX6) || defined(CHIP_PIC32MX7)

#  define INT_CT                     (1 << 0)  /* Vector: 0, Core Timer Interrupt */
#  define INT_CS0                    (1 << 1)  /* Vector: 1, Core Software Interrupt 0 */
#  define INT_CS1                    (1 << 2)  /* Vector: 2, Core Software Interrupt 1 */
#  define INT_INT0                   (1 << 3)  /* Vector: 3, External Interrupt 0 */
#  define INT_T1                     (1 << 4)  /* Vector: 4, Timer 1 */
#  define INT_IC1                    (1 << 5)  /* Vector: 5, Input Capture 1 */
#  define INT_OC1                    (1 << 6)  /* Vector: 6, Output Compare 1 */
#  define INT_INT1                   (1 << 7)  /* Vector: 7, External Interrupt 1 */
#  define INT_T2                     (1 << 8)  /* Vector: 8, Timer 2 */
#  define INT_IC2                    (1 << 9)  /* Vector: 9, Input Capture 2 */
#  define INT_OC2                    (1 << 10) /* Vector: 10, Output Compare 2 */
#  define INT_INT2                   (1 << 11) /* Vector: 11, External Interrupt 2 */
#  define INT_T3                     (1 << 12) /* Vector: 12, Timer 3 */
#  define INT_IC3                    (1 << 13) /* Vector: 13, Input Capture 3 */
#  define INT_OC3                    (1 << 14) /* Vector: 14, Output Compare 3 */
#  define INT_INT3                   (1 << 15) /* Vector: 15, External Interrupt 3 */
#  define INT_T4                     (1 << 16) /* Vector: 16, Timer 4 */
#  define INT_IC4                    (1 << 17) /* Vector: 17, Input Capture 4 */
#  define INT_OC4                    (1 << 18) /* Vector: 18, Output Compare 4 */
#  define INT_INT4                   (1 << 19) /* Vector: 19, External Interrupt 4 */
#  define INT_T5                     (1 << 20) /* Vector: 20, Timer 5 */
#  define INT_IC5                    (1 << 21) /* Vector: 21, Input Capture 5 */
#  define INT_OC5                    (1 << 22) /* Vector: 22, Output Compare 5 */
#  define INT_SPI1E                  (1 << 23) /* Vector: 23, SPI1 Error */
#  define INT_SPI1TX                 (1 << 24) /* Vector: 23, "  " Transfer done */
#  define INT_SPI1RX                 (1 << 25) /* Vector: 23, "  " Receive done */
#  define INT_26                     (1 << 26) /* Vector: 24, UART1, SPI3, I2C3 */
#    define INT_U1E                  (1 << 26) /* Vector: 24, UART1 Error */
#    define INT_SPI3E                (1 << 26) /* Vector: 24, SPI3 Fault */
#    define INT_I2C3B                (1 << 26) /* Vector: 24, I2C3 Bus collision event */
#  define INT_27                     (1 << 27) /* Vector: 24, UART1, SPI3, I2C3 */
#    define INT_U1RX                 (1 << 27) /* Vector: 24, UART1 Receiver */
#    define INT_SPI3RX               (1 << 27) /* Vector: 24, SPI3 Receive done */
#    define INT_I2C3S                (1 << 27) /* Vector: 24, I2C3 Slave event */
#  define INT_28                     (1 << 28) /* Vector: 24, UART1, SPI3, I2C3 */
#    define INT_U1TX                 (1 << 28) /* Vector: 24, UART1 Transmitter */
#    define INT_SPI3TX               (1 << 28) /* Vector: 24, SPI3 Transfer done */
#    define INT_I2C3M                (1 << 28) /* Vector: 24, I2C3 Master event */
#  define INT_I2C1B                  (1 << 29) /* Vector: 25, I2C1 Bus collision event */
#  define INT_I2C1S                  (1 << 30) /* Vector: 25, "  " Slave event */
#  define INT_I2C1M                  (1 << 31) /* Vector: 25, "  " Master event */

#else
#  error "Unknown PIC32MX family"
#endif

/* Interrupt flag status register 1 and Interrupt enable control register 1 */

#if defined(CHIP_PIC32MX1) || defined(CHIP_PIC32MX2)

