apache/nuttx/arch/mips/src/pic32mx/pic32mx_int.h
#  define INT_CMP1                   (1 << 0)  /* Vector: 27, Comparator 1 Interrupt */
#  define INT_CMP2                   (1 << 1)  /* Vector: 28, Comparator 2 Interrupt */
#  define INT_CMP3                   (1 << 2)  /* Vector: 29, Comparator 3 Interrupt */
#  define INT_USB                    (1 << 3)  /* Vector: 30, USB */
#  define INT_SPI1E                  (1 << 4)  /* Vector: 31, SPI1 */
#  define INT_SPI1TX                 (1 << 5)  /* Vector: 31, "  " */
#  define INT_SPI1RX                 (1 << 6)  /* Vector: 31, "  " */
#  define INT_U1E                    (1 << 7)  /* Vector: 32, UART1 */
#  define INT_U1RX                   (1 << 8)  /* Vector: 32, "   " */
#  define INT_U1TX                   (1 << 9)  /* Vector: 32, "   " */
#  define INT_I2C1B                  (1 << 10) /* Vector: 33, I2C1 */
#  define INT_I2C1S                  (1 << 11) /* Vector: 33, "  " */
#  define INT_I2C1M                  (1 << 12) /* Vector: 33, "  " */
#  define INT_CNA                    (1 << 13) /* Vector: 34, Input Change Interrupt */
#  define INT_CNB                    (1 << 14) /* Vector: 34, Input Change Interrupt */
#  define INT_CNC                    (1 << 15) /* Vector: 34, Input Change Interrupt */
#  define INT_PMP                    (1 << 16) /* Vector: 35, Parallel Master Port */
#  define INT_PMPE                   (1 << 17) /* Vector: 35, Parallel Master Port */
#  define INT_SPI2E                  (1 << 18) /* Vector: 36, SPI2 */
#  define INT_SPI2TX                 (1 << 19) /* Vector: 36, "  " */
#  define INT_SPI2RX                 (1 << 20) /* Vector: 36, "  " */
#  define INT_U2E                    (1 << 21) /* Vector: 37, UART2 */
#  define INT_U2RX                   (1 << 22) /* Vector: 37, "   " */
#  define INT_U2TX                   (1 << 23) /* Vector: 37, "   " */
#  define INT_I2C2B                  (1 << 24) /* Vector: 38, I2C2 */
#  define INT_I2C2S                  (1 << 25) /* Vector: 38, "  " */
#  define INT_I2C2M                  (1 << 26) /* Vector: 38, "  " */
#  define INT_CTMU                   (1 << 27) /* Vector: 39, CTMU */
#  define INT_DMA0                   (1 << 28) /* Vector: 40, DMA Channel 0 */
#  define INT_DMA1                   (1 << 29) /* Vector: 41, DMA Channel 1 */
#  define INT_DMA2                   (1 << 30) /* Vector: 42, DMA Channel 2 */
#  define INT_DMA3                   (1 << 31) /* Vector: 43, DMA Channel 3 */

#elif defined(CHIP_PIC32MX3) || defined(CHIP_PIC32MX4)

#  define INT_CN                     (1 << 0)  /* Vector: 26, Input Change Interrupt */
#  define INT_AD1                    (1 << 1)  /* Vector: 27, ADC1 Convert Done */
#  define INT_PMP                    (1 << 2)  /* Vector: 28, Parallel Master Port */
#  define INT_CMP1                   (1 << 3)  /* Vector: 29, Comparator Interrupt */
#  define INT_CMP2                   (1 << 4)  /* Vector: 30, Comparator Interrupt */
#  define INT_SPI2E                  (1 << 5)  /* Vector: 31, SPI2 Error */
#  define INT_SPI2TX                 (1 << 6)  /* Vector: 31, "  " Transfer done */
#  define INT_SPI2RX                 (1 << 7)  /* Vector: 31, "  " Receive done*/
#  define INT_U2E                    (1 << 8)  /* Vector: 32, UART2 Error */
#  define INT_U2RX                   (1 << 9)  /* Vector: 32, "   " Receiver */
#  define INT_U2TX                   (1 << 10) /* Vector: 32, "   " Transmitter */
#  define INT_I2C2B                  (1 << 11) /* Vector: 33, I2C2 Bus collision event */
#  define INT_I2C2S                  (1 << 12) /* Vector: 33, "  " Master event */
#  define INT_I2C2M                  (1 << 13) /* Vector: 33, "  " Slave event */
#  define INT_FSCM                   (1 << 14) /* Vector: 34, Fail-Safe Clock Monitor */
#  define INT_RTCC                   (1 << 15) /* Vector: 35, Real-Time Clock and Calendar */
#  define INT_DMA0                   (1 << 16) /* Vector: 36, DMA Channel 0 */
#  define INT_DMA1                   (1 << 17) /* Vector: 37, DMA Channel 1 */
#  define INT_DMA2                   (1 << 18) /* Vector: 38, DMA Channel 2 */
#  define INT_DMA3                   (1 << 19) /* Vector: 39, DMA Channel 3 */
#  define INT_FCE                    (1 << 24) /* Vector: 44, Flash Control Event */
#  define INT_USB                    (1 << 25) /* Vector: 45, USB Interrupt */

#elif defined(CHIP_PIC32MX5) || defined(CHIP_PIC32MX6) || defined(CHIP_PIC32MX7)

#  define INT_CN                     (1 << 0)  /* Vector: 26, Input Change Interrupt */
#  define INT_AD1                    (1 << 1)  /* Vector: 27, ADC1 Convert Done */
#  define INT_PMP                    (1 << 2)  /* Vector: 28, Parallel Master Port */
#  define INT_CMP1                   (1 << 3)  /* Vector: 29, Comparator Interrupt */
#  define INT_CMP2                   (1 << 4)  /* Vector: 30, Comparator Interrupt */
#  define INT_37                     (1 << 5)  /* Vector: 31, UART3, SPI2, I2C4 */
#    define INT_U3E                  (1 << 5)  /* Vector: 31, UART3 Error */
#    define INT_SPI2E                (1 << 5)  /* Vector: 31, SPI2 Fault */
#    define INT_I2C4B                (1 << 5)  /* Vector: 31, I2C4 Bus collision event */
#  define INT_38                     (1 << 6)  /* Vector: 31, UART3, SPI2, I2C4 */
#    define INT_U3RX                 (1 << 6)  /* Vector: 31, UART3 Receiver */
#    define INT_SPI2RX               (1 << 6)  /* Vector: 31, SPI2 Receive done */
#    define INT_I2C4S                (1 << 6)  /* Vector: 31, I2C4 Slave event */
#  define INT_39                     (1 << 7)  /* Vector: 31, UART3, SPI2, I2C4 */
#    define INT_U3TX                 (1 << 7)  /* Vector: 31, UART3 Transmitter */
#    define INT_SPI2TX               (1 << 7)  /* Vector: 31, SPI2 Transfer done */
#    define INT_I2C4M                (1 << 7)  /* Vector: 31, I2C4 Master event */
#  define INT_40                     (1 << 8)  /* Vector: 32, UART2, SPI4, I2C5 */
#    define INT_U2E                  (1 << 8)  /* Vector: 32, UART2 Error */
#    define INT_SPI4E                (1 << 8)  /* Vector: 32, SPI4 Fault */
#    define INT_I2C5B                (1 << 8)  /* Vector: 32, I2C5 Bus collision event */
#  define INT_41                     (1 << 9)  /* Vector: 32, UART2, SPI4, I2C5 */
#    define INT_U2RX                 (1 << 9)  /* Vector: 32, UART2 Receiver */
#    define INT_SPI4RX               (1 << 9)  /* Vector: 32, SPI4 Receive done */
#    define INT_I2C5S                (1 << 9)  /* Vector: 32, I2C5 Slave event */
#  define INT_42                     (1 << 10) /* Vector: 32, UART2, SPI4, I2C5 */
#    define INT_U2TX                 (1 << 10) /* Vector: 32, UART2 Transmitter */
#    define INT_SPI4TX               (1 << 10) /* Vector: 32, SPI4 Transfer done */
#    define INT_I2C5M                (1 << 10) /* Vector: 32, I2C5 Master event */
#  define INT_I2C2B                  (1 << 11) /* Vector: 33, I2C2 Bus collision event */
#  define INT_I2C2S                  (1 << 12) /* Vector: 33, "  " Master event */
#  define INT_I2C2M                  (1 << 13) /* Vector: 33, "  " Slave event */
#  define INT_FSCM                   (1 << 14) /* Vector: 34, Fail-Safe Clock Monitor */
#  define INT_RTCC                   (1 << 15) /* Vector: 35, Real-Time Clock and Calendar */
#  define INT_DMA0                   (1 << 16) /* Vector: 36, DMA Channel 0 */
#  define INT_DMA1                   (1 << 17) /* Vector: 37, DMA Channel 1 */
#  define INT_DMA2                   (1 << 18) /* Vector: 38, DMA Channel 2 */
#  define INT_DMA3                   (1 << 19) /* Vector: 39, DMA Channel 3 */
#  define INT_DMA4                   (1 << 20) /* Vector: 40, DMA Channel 3 */
#  define INT_DMA5                   (1 << 21) /* Vector: 41, DMA Channel 3 */
#  define INT_DMA6                   (1 << 22) /* Vector: 42, DMA Channel 3 */
#  define INT_DMA7                   (1 << 23) /* Vector: 43, DMA Channel 3 */
#  define INT_FCE                    (1 << 24) /* Vector: 44, Flash Control Event */
#  define INT_USB                    (1 << 25) /* Vector: 45, USB Interrupt */
#  define INT_CAN1                   (1 << 26) /* Vector: 46, Control Area Network 1 */
#  define INT_CAN2                   (1 << 27) /* Vector: 47, Control Area Network 2 */
#  define INT_ETH                    (1 << 28) /* Vector: 48, Ethernet interrupt */
#  define INT_IC1E                   (1 << 29) /* Vector: 5, Input capture 1 error */
#  define INT_IC2E                   (1 << 30) /* Vector: 9, Input capture 1 error */
#  define INT_IC3E                   (1 << 31) /* Vector: 13, Input capture 1 error */

#else
#  error "Unknown PIC32MX family"
#endif

/* Interrupt flag status register 2 and Interrupt enable control register 2 */

