apache/nuttx/arch/mips/src/pic32mx/pic32mx_int.h
#define INT_IPC4_T4IS_SHIFT          (0)   /* Bits 0-1, Vector: 16, Timer 4 */
#define INT_IPC4_T4IS_MASK           (3 << INT_IPC4_T4IS_SHIFT)
#define INT_IPC4_T4IP_SHIFT          (2)   /* Bits 2-4, Vector: 16, Timer 4 */
#define INT_IPC4_T4IP_MASK           (7 << INT_IPC4_T4IP_SHIFT)
#define INT_IPC4_IC4IS_SHIFT         (8)   /* Bits 8-9, Vector: 17, Input Capture 4 */
#define INT_IPC4_IC4IS_MASK          (3 << INT_IPC4_IC4IS_SHIFT)
#define INT_IPC4_IC4IP_SHIFT         (10)  /* Bits 10-12, Vector: 17, Input Capture 4 */
#define INT_IPC4_IC4IP_MASK          (7 << INT_IPC4_IC4IP_SHIFT)
#define INT_IPC4_OC4IS_SHIFT         (16)  /* Bits 16-17, Vector: 18, Output Compare 4 */
#define INT_IPC4_OC4IS_MASK          (3 << INT_IPC4_OC4IS_SHIFT)
#define INT_IPC4_OC4IP_SHIFT         (18)  /* Bits 18-20, Vector: 18, Output Compare 4 */
#define INT_IPC4_OC4IP_MASK          (7 << INT_IPC4_OC4IP_SHIFT)
#define INT_IPC4_INT4IS_SHIFT        (24)  /* Bits 24-25, Vector: 19, External Interrupt 4 */
#define INT_IPC4_INT4IS_MASK         (3 << INT_IPC4_INT4IS_SHIFT)
#define INT_IPC4_INT4IP_SHIFT        (26)  /* Bits 26-28, Vector: 19, External Interrupt 4 */
#define INT_IPC4_INT4IP_MASK         (7 << INT_IPC4_INT4IP_SHIFT)

#if defined(CHIP_PIC32MX1) || defined(CHIP_PIC32MX2)

#  define INT_IPC5_T5IS_SHIFT        (0)   /* Bits 0-1, Vector: 20, Timer 5 */
#  define INT_IPC5_T5IS_MASK         (3 << INT_IPC5_T5IS_SHIFT)
#  define INT_IPC5_T5IP_SHIFT        (2)   /* Bits 2-4, Vector: 20, Timer 5 */
#  define INT_IPC5_T5IP_MASK         (7 << INT_IPC5_T5IP_SHIFT)
#  define INT_IPC5_IC5IS_SHIFT       (8)   /* Bits 8-9, Vector: 21, Input Capture 5 */
#  define INT_IPC5_IC5IS_MASK        (3 << INT_IPC5_IC5IS_SHIFT)
#  define INT_IPC5_IC5IP_SHIFT       (10)  /* Bits 10-12, Vector: 21, Input Capture 5 */
#  define INT_IPC5_IC5IP_MASK        (7 << INT_IPC5_IC5IP_SHIFT)
#  define INT_IPC5_OC5IS_SHIFT       (16)  /* Bits 16-17, Vector: 22, Output Compare 5 */
#  define INT_IPC5_OC5IS_MASK        (3 << INT_IPC5_OC5IS_SHIFT)
#  define INT_IPC5_OC5IP_SHIFT       (18)  /* Bits 18-20, Vector: 22, Output Compare 5 */
#  define INT_IPC5_OC5IP_MASK        (7 << INT_IPC5_OC5IP_SHIFT)
#  define INT_IPC5_SPI1IS_SHIFT      (24)  /* Bits 24-25, Vector: 23, SPI1 */
#  define INT_IPC5_SPI1IS_MASK       (3 << INT_IPC5_SPI1IS_SHIFT)
#  define INT_IPC5_SPI1IP_SHIFT      (26)  /* Bits 26-28, Vector: 23, SPI1 */
#  define INT_IPC5_SPI1IP_MASK       (7 << INT_IPC5_SPI1IP_SHIFT)
#  define INT_IPC6_AD1IS_SHIFT       (24)  /* Bits 24-25, Vector: 23, ADC1 Convert Done */
#  define INT_IPC6_AD1IS_MASK        (3 << INT_IPC6_AD1IS_SHIFT)
#  define INT_IPC6_AD1IP_SHIFT       (26)  /* Bits 26-28, Vector: 23, ADC1 Convert Done */
#  define INT_IPC6_AD1IP_MASK        (7 << INT_IPC6_AD1IP_SHIFT)

#else

#  define INT_IPC5_T5IS_SHIFT        (0)   /* Bits 0-1, Vector: 20, Timer 5 */
#  define INT_IPC5_T5IS_MASK         (3 << INT_IPC5_T5IS_SHIFT)
#  define INT_IPC5_T5IP_SHIFT        (2)   /* Bits 2-4, Vector: 20, Timer 5 */
#  define INT_IPC5_T5IP_MASK         (7 << INT_IPC5_T5IP_SHIFT)
#  define INT_IPC5_IC5IS_SHIFT       (8)   /* Bits 8-9, Vector: 21, Input Capture 5 */
#  define INT_IPC5_IC5IS_MASK        (3 << INT_IPC5_IC5IS_SHIFT)
#  define INT_IPC5_IC5IP_SHIFT       (10)  /* Bits 10-12, Vector: 21, Input Capture 5 */
#  define INT_IPC5_IC5IP_MASK        (7 << INT_IPC5_IC5IP_SHIFT)
#  define INT_IPC5_OC5IS_SHIFT       (16)  /* Bits 16-17, Vector: 22, Output Compare 5 */
#  define INT_IPC5_OC5IS_MASK        (3 << INT_IPC5_OC5IS_SHIFT)
#  define INT_IPC5_OC5IP_SHIFT       (18)  /* Bits 18-20, Vector: 22, Output Compare 5 */
#  define INT_IPC5_OC5IP_MASK        (7 << INT_IPC5_OC5IP_SHIFT)
#  define INT_IPC5_SPI1IS_SHIFT      (24)  /* Bits 24-25, Vector: 23, SPI1 */
#  define INT_IPC5_SPI1IS_MASK       (3 << INT_IPC5_SPI1IS_SHIFT)
#  define INT_IPC5_SPI1IP_SHIFT      (26)  /* Bits 26-28, Vector: 23, SPI1 */
#  define INT_IPC5_SPI1IP_MASK       (7 << INT_IPC5_SPI1IP_SHIFT)

#endif

#if defined(CHIP_PIC32MX1) || defined(CHIP_PIC32MX2)

#  define INT_IPC6_FSCMIS_SHIFT      (0)   /* Bits 0-1, Vector: 24, Fail-Safe Clock Monitor */
#  define INT_IPC6_FSCMIS_MASK       (3 << INT_IPC6_FSCMIS_SHIFT)
#  define INT_IPC6_FSCMIP_SHIFT      (2)   /* Bits 2-4, Vector: 24, Fail-Safe Clock Monitor */
#  define INT_IPC6_FSCMIP_MASK       (7 << INT_IPC6_FSCMIP_SHIFT)
#  define INT_IPC6_RTCCIS_SHIFT      (8)   /* Bits 8-9, Vector: 25, Real-Time Clock and Calendar */
#  define INT_IPC6_RTCCIS_MASK       (3 << INT_IPC6_RTCCIS_SHIFT)
#  define INT_IPC6_RTCCIP_SHIFT      (10)  /* Bits 10-12, Vector: 25, Real-Time Clock and Calendar */
#  define INT_IPC6_RTCCIP_MASK       (7 << INT_IPC6_RTCCIP_SHIFT)
#  define INT_IPC6_FCEIS_SHIFT       (16)  /* Bits 16-17, Vector: 26, Flash Control Event */
#  define INT_IPC6_FCEIS_MASK        (3 << INT_IPC6_FCEIS_SHIFT)
#  define INT_IPC6_FCEIP_SHIFT       (18)  /* Bits 18-20, Vector: 26, Flash Control Event */
#  define INT_IPC6_FCEIP_MASK        (7 << INT_IPC6_FCEIP_SHIFT)
#  define INT_IPC6_CMP1IS_SHIFT      (24)  /* Bits 24-25, Vector: 27, Comparator 1 */
#  define INT_IPC6_CMP1IS_MASK       (3 << INT_IPC6_CMP1IS_SHIFT)
#  define INT_IPC6_CMP1IP_SHIFT      (26)  /* Bits 26-28, Vector: 27, Comparator 1 */
#  define INT_IPC6_CMP1IP_MASK       (7 << INT_IPC6_CMP1IP_SHIFT)

#  define INT_IPC7_CMP2IS_SHIFT      (0)   /* Bits 0-1, Vector: 28, Comparator 2 */
#  define INT_IPC7_CMP2IS_MASK       (3 << INT_IPC7_CMP2IS_SHIFT)
#  define INT_IPC7_CMP2IP_SHIFT      (2)   /* Bits 2-4, Vector: 28, Comparator 2 */
#  define INT_IPC7_CMP2IP_MASK       (7 << INT_IPC7_CMP2IP_SHIFT)
#  define INT_IPC7_CMP3IS_SHIFT      (8)   /* Bits 8-9, Vector: 29, Comparator Interrupt */
#  define INT_IPC7_CMP3IS_MASK       (3 << INT_IPC7_CMP3IS_SHIFT)
#  define INT_IPC7_CMP3IP_SHIFT      (10)  /* Bits 10-12, Vector: 29, Comparator Interrupt */
#  define INT_IPC7_CMP3IP_MASK       (7 << INT_IPC7_CMP3IP_SHIFT)
#  define INT_IPC7_USBIS_SHIFT       (16)  /* Bits 16-17, Vector: 30, Comparator Interrupt */
#  define INT_IPC7_USBIS_MASK        (3 << INT_IPC7_USBIS_SHIFT)
#  define INT_IPC7_USBIP_SHIFT       (18)  /* Bits 18-20, Vector: 30, Comparator Interrupt */
#  define INT_IPC7_USBIP_MASK        (7 << INT_IPC7_USBIP_SHIFT)
#  define INT_IPC7_SPI1IS_SHIFT      (24)  /* Bits 24-25, Vector: 31, SPI1 */
#  define INT_IPC7_SPI1IS_MASK       (3 << INT_IPC7_SPI1IS_SHIFT)
#  define INT_IPC7_SPI1IP_SHIFT      (26)  /* Bits 26-28, Vector: 31, SPI1 */
#  define INT_IPC7_SPI1IP_MASK       (7 << INT_IPC7_SPI1IP_SHIFT)

#  define INT_IPC8_U1IS_SHIFT        (0)   /* Bits 0-1, Vector: 32, UART1 */
#  define INT_IPC8_U1IS_MASK         (3 << INT_IPC8_U1IS_SHIFT)
#  define INT_IPC8_U1IP_SHIFT        (2)   /* Bits 2-4, Vector: 32, UART1 */
#  define INT_IPC8_U1IP_MASK         (7 << INT_IPC8_U1IP_SHIFT)
#  define INT_IPC8_I2C1IS_SHIFT      (8)   /* Bits 8-9, Vector: 33, I2C1 */
#  define INT_IPC8_I2C1IS_MASK       (3 << INT_IPC8_I2C1IS_SHIFT)
#  define INT_IPC8_I2C1IP_SHIFT      (10)  /* Bits 10-12, Vector: 33, I2C1 */
#  define INT_IPC8_I2C1IP_MASK       (7 << INT_IPC8_I2C1IP_SHIFT)
#  define INT_IPC8_CNIS_SHIFT        (16)  /* Bits 16-17, Vector: 34, Input Change */
#  define INT_IPC8_CNIS_MASK         (3 << INT_IPC8_CNIS_SHIFT)
#  define INT_IPC8_CNIP_SHIFT        (18)  /* Bits 18-20, Vector: 34, Input Change */
#  define INT_IPC8_CNIP_MASK         (7 << INT_IPC8_CNIP_SHIFT)
#  define INT_IPC8_PMPIS_SHIFT      (24)  /* Bits 24-25, Vector: 35, Parallel Master Port */
#  define INT_IPC8_PMPIS_MASK       (3 << INT_IPC8_PMPIS_SHIFT)
#  define INT_IPC8_PMPIP_SHIFT      (26)  /* Bits 26-28, Vector: 35, RParallel Master Port */
#  define INT_IPC8_PMPIP_MASK       (7 << INT_IPC8_PMPIP_SHIFT)

#  define INT_IPC9_SPI2IS_SHIFT      (0)   /* Bits 0-1, Vector: 36, SPI2 */
#  define INT_IPC9_SPI2IS_MASK       (3 << INT_IPC9_SPI2IS_SHIFT)
#  define INT_IPC9_SPI2IP_SHIFT      (2)   /* Bits 2-4, Vector: 36, SPI2 */
#  define INT_IPC9_SPI2IP_MASK       (7 << INT_IPC9_SPI2IP_SHIFT)
#  define INT_IPC9_U2IS_SHIFT        (8)   /* Bits 8-9, Vector: 37, UART2 */
#  define INT_IPC9_U2IS_MASK         (3 << INT_IPC9_U2IS_SHIFT)
#  define INT_IPC9_U2IP_SHIFT        (10)  /* Bits 10-12, Vector: 37, UART2 */
#  define INT_IPC9_U2IP_MASK         (7 << INT_IPC9_U2IP_SHIFT)
#  define INT_IPC9_I2C2IS_SHIFT      (16)  /* Bits 16-17, Vector: 38, I2C2 */
#  define INT_IPC9_I2C2IS_MASK       (3 << INT_IPC9_I2C2IS_SHIFT)
#  define INT_IPC9_I2C2IP_SHIFT      (18)  /* Bits 18-20, Vector: 38, I2C2 */
#  define INT_IPC9_I2C2IP_MASK       (7 << INT_IPC9_I2C2IP_SHIFT)
#  define INT_IPC9_CTMUIS_SHIFT      (24)  /* Bits 24-25, Vector: 39, CTMU */
#  define INT_IPC9_CTMUIS_MASK       (3 << INT_IPC9_CTMUIS_SHIFT)
#  define INT_IPC9_CTMUIP_SHIFT      (26)  /* Bits 26-28, Vector: 39, CTMU */
#  define INT_IPC9_CTMUIP_MASK       (7 << INT_IPC9_CTMUIP_SHIFT)

#  define INT_IPC10_DMA0IS_SHIFT      (0)   /* Bits 0-1, Vector: 40, DMA Channel 0 */
#  define INT_IPC10_DMA0IS_MASK       (3 << INT_IPC10_DMA0IS_SHIFT)
#  define INT_IPC10_DMA0IP_SHIFT      (2)   /* Bits 2-4, Vector: 40, DMA Channel 0 */
#  define INT_IPC10_DMA0IP_MASK       (7 << INT_IPC10_DMA0IP_SHIFT)
#  define INT_IPC10_DMA1IS_SHIFT      (8)   /* Bits 8-10, Vector: 41, DMA Channel 1 */
#  define INT_IPC10_DMA1IS_MASK       (3 << INT_IPC10_DMA1IS_SHIFT)
#  define INT_IPC10_DMA1IP_SHIFT      (10)  /* Bits 10-12, Vector: 41, DMA Channel 1 */
#  define INT_IPC10_DMA1IP_MASK       (7 << INT_IPC10_DMA1IP_SHIFT)
#  define INT_IPC10_DMA2IS_SHIFT      (16)  /* Bits 16-17, Vector: 42, DMA Channel 2 */
#  define INT_IPC10_DMA2IS_MASK       (3 << INT_IPC10_DMA2IS_SHIFT)
#  define INT_IPC10_DMA2IP_SHIFT      (18)  /* Bits 18-20, Vector: 42, DMA Channel 2 */
#  define INT_IPC10_DMA2IP_MASK       (7 << INT_IPC10_DMA2IP_SHIFT)
#  define INT_IPC10_DMA3IS_SHIFT      (24)  /* Bits 24-25, Vector: 43, DMA Channel 3 */
#  define INT_IPC10_DMA3IS_MASK       (3 << INT_IPC10_DMA3IS_SHIFT)
#  define INT_IPC10_DMA3IP_SHIFT      (26)  /* Bits 26-28, Vector: 43, DMA Channel 3 */
#  define INT_IPC10_DMA3IP_MASK       (7 << INT_IPC10_DMA3IP_SHIFT)

#elif defined(CHIP_PIC32MX3) || defined(CHIP_PIC32MX4)

